Revit 2027 API
BuiltInFailures.EnergyAnalysisFailures.RoomVolumeNegativeWarn Property
 [Room] has a negative volume? [Room] will be ignored in the energy analysis model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoomVolumeNegativeWarn { get; }
Public Shared ReadOnly Property RoomVolumeNegativeWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoomVolumeNegativeWarn {
	FailureDefinitionId^ get ();
}
static member RoomVolumeNegativeWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace